app/views/home/simple_dashboard.html.erb

        <div class="card-body">
          <h3 class="text-success"><%= Location.count %></h3>
---
SELECT COUNT(*) FROM "locations"

        <div class="card-body">
          <h3 class="text-info"><%= Chemical.count %></h3>
---
SELECT COUNT(*) FROM "chemicals"