app/controllers/api/v1/dispersion_events_controller.rb

  def index
    @dispersion_events = DispersionEvent.includes(:chemical, :location)
                                       .order(created_at: :desc)
                                       .limit(50)

    render_success(@dispersion_events.map { |event| dispersion_event_data(event) })
---
SELECT "chemicals".* FROM "chemicals" WHERE "chemicals"."id" IN (2, 1)
SELECT "dispersion_events".* FROM "dispersion_events" ORDER BY "dispersion_events"."created_at" DESC LIMIT 50
SELECT "locations".* FROM "locations" WHERE "locations"."id" IN (2, 1)

  def live_calculations
    # Return real-time calculation data for WebSocket updates
    calculations = @dispersion_event.dispersion_calculations
                                   .includes(:weather_datum)
                                   .where('created_at > ?', 1.minute.ago)
                                   .order(created_at: :desc)

    render_success({
      event_id: @dispersion_event.id,
      calculations: calculations.map { |c| calculation_data(c) },
      timestamp: Time.current
    })
---
SELECT "dispersion_calculations".* FROM "dispersion_calculations" WHERE "dispersion_calculations"."dispersion_event_id" = 5 AND (created_at > '2025-10-04 02:06:51.307753') ORDER BY "dispersion_calculations"."created_at" DESC
SELECT "dispersion_calculations".* FROM "dispersion_calculations" WHERE "dispersion_calculations"."dispersion_event_id" = 3 ORDER BY "dispersion_calculations"."created_at" DESC LIMIT 1
SELECT "dispersion_calculations".* FROM "dispersion_calculations" WHERE "dispersion_calculations"."dispersion_event_id" = 5 AND (created_at > '2025-10-04 02:30:39.066094') ORDER BY "dispersion_calculations"."created_at" DESC

  def plume_data
    # Generate plume contour data for map visualization
    latest_calculation = @dispersion_event.dispersion_calculations
                                         .includes(:weather_datum)
                                         .order(created_at: :desc)
                                         .first
---
SELECT "dispersion_calculations".* FROM "dispersion_calculations" WHERE "dispersion_calculations"."dispersion_event_id" = 3 ORDER BY "dispersion_calculations"."created_at" DESC LIMIT 1

  def set_dispersion_event
    @dispersion_event = DispersionEvent.find(params[:id])
---
SELECT "dispersion_events".* FROM "dispersion_events" WHERE "dispersion_events"."id" = 5 LIMIT 1