app/controllers/api/v1/dispersion_events_controller.rb

  def set_dispersion_event
    @dispersion_event = DispersionEvent.find(params[:id])
---
SELECT "dispersion_events".* FROM "dispersion_events" WHERE "dispersion_events"."id" = 3 LIMIT 1

  def receptor_data(receptor)
    latest_calc = receptor.dispersion_calculations.order(created_at: :desc).first
---
SELECT "dispersion_calculations".* FROM "dispersion_calculations" WHERE "dispersion_calculations"."dispersion_event_id" = 3 AND (created_at > '2025-10-04 02:38:20.176826') ORDER BY "dispersion_calculations"."created_at" DESC