app/controllers/api/v1/locations_controller.rb

SELECT "locations".* FROM "locations" ORDER BY "locations"."name" ASC
SELECT COUNT(*) FROM "locations"
---
  def index
    @locations = Location.all.order(:name)

    render_success({
      locations: @locations.map { |location| location_data(location) },
      count: @locations.count
    })