app/views/dispersion_events/new.html.erb

              <%= form.label :chemical_id, "Chemical", class: "form-label" %>
              <%= form.collection_select :chemical_id, Chemical.all, :id, :name,
                    { prompt: "Select a chemical" },
                    { class: "form-select", required: true } %>
---
SELECT "chemicals".* FROM "chemicals"

              <%= form.label :location_id, "Location", class: "form-label" %>
              <%= form.collection_select :location_id, Location.all, :id, :name,
                    { prompt: "Select a location" },
                    { class: "form-select", required: true } %>
---
SELECT "locations".* FROM "locations"