app/views/dispersion_events/show.html.erb

          <div class="text-center">
            <h3 class="text-primary"><%= @dispersion_event.receptors.count %></h3>
---
SELECT COUNT(*) FROM "receptors" WHERE "receptors"."dispersion_event_id" = 5