app/controllers/dispersion_events_controller.rb

SELECT "chemicals".* FROM "chemicals" ORDER BY "chemicals"."name" ASC
SELECT "locations".* FROM "locations" ORDER BY "locations"."name" ASC
---
  def new
    @dispersion_event = DispersionEvent.new
    @chemicals = Chemical.all.order(:name)
    @locations = Location.all.order(:name)

INSERT INTO "dispersion_events" ("chemical_id", "location_id", "release_rate", "release_volume", "release_mass", "release_duration", "release_type", "started_at", "ended_at", "status", "notes", "created_at", "updated_at") VALUES (1, 1, 34.0, 34.0, NULL, 34.0, 'continuous', '2025-10-04 13:06:00', '2025-10-04 13:06:00', 'active', '', '2025-10-04 18:07:00.121822', '2025-10-04 18:07:00.121822') RETURNING "id"
---
  def create
    @dispersion_event = DispersionEvent.new(dispersion_event_params)

    if @dispersion_event.save

SELECT "dispersion_events".* FROM "dispersion_events" WHERE "dispersion_events"."id" = 3 LIMIT 1
---
  def set_dispersion_event
    @dispersion_event = DispersionEvent.find(params[:id])

INSERT INTO "receptors" ("dispersion_event_id", "name", "latitude", "longitude", "distance_from_source", "concentration", "exposure_time", "health_impact_level", "notes", "created_at", "updated_at") VALUES (5, 'Receptor 100m 0°', 29.7612983111749910168, -95.3698, 99.88764520711348, NULL, NULL, NULL, NULL, '2025-10-04 18:08:59.786395', '2025-10-04 18:08:59.786395') RETURNING "id"
---
  def create_default_receptors
    # Create a grid of receptors around the source location
    source_lat = @dispersion_event.location.latitude
    source_lng = @dispersion_event.location.longitude

    # Create receptors at various distances and directions
    distances = [100, 500, 1000, 2000, 5000] # meters
    directions = [0, 45, 90, 135, 180, 225, 270, 315] # degrees

    distances.each do |distance|
      directions.each do |direction|
        # Calculate lat/lng offset based on distance and direction
        lat_offset = (distance * Math.cos(direction * Math::PI / 180)) / 111320.0
        lng_offset = (distance * Math.sin(direction * Math::PI / 180)) / (111320.0 * Math.cos(source_lat * Math::PI / 180))

        @dispersion_event.receptors.create!(
          name: "Receptor #{distance}m #{direction}°",
          latitude: source_lat + lat_offset,
          longitude: source_lng + lng_offset,
          height: 1.5 # Standard breathing height
        )