app/controllers/home_controller.rb

SELECT "chemicals".* FROM "chemicals" WHERE "chemicals"."id" IN (2, 1)
SELECT "dispersion_events".* FROM "dispersion_events" ORDER BY "dispersion_events"."created_at" DESC LIMIT 5
SELECT "locations".* FROM "locations" WHERE "locations"."id" IN (2, 1)
SELECT COUNT(*) FROM "locations"
SELECT COUNT(*) FROM "chemicals"
---
  def index
    # Main landing page
    @recent_events = DispersionEvent.includes(:chemical, :location)
                                   .order(created_at: :desc)
                                   .limit(5)
    @active_events = DispersionEvent.where(status: 'active')
                                   .includes(:chemical, :location)
    @total_chemicals = Chemical.count
    @total_locations = Location.count

SELECT "chemicals".* FROM "chemicals" WHERE "chemicals"."id" IN (2, 1)
SELECT "dispersion_calculations".* FROM "dispersion_calculations" WHERE "dispersion_calculations"."dispersion_event_id" IN (3, 5, 7)
SELECT "dispersion_events".* FROM "dispersion_events" WHERE "dispersion_events"."status" = 'active'
SELECT "locations".* FROM "locations" WHERE "locations"."id" IN (2, 1)
SELECT "receptors".* FROM "receptors" WHERE "receptors"."dispersion_event_id" IN (3, 5, 7)
SELECT "dispersion_calculations".* FROM "dispersion_calculations" WHERE "dispersion_calculations"."dispersion_event_id" = 3 ORDER BY "dispersion_calculations"."created_at" DESC LIMIT 1
SELECT COUNT(*) FROM "dispersion_calculations" WHERE (created_at >= '2025-10-04')
SELECT COUNT(*) FROM "dispersion_events" WHERE "dispersion_events"."status" = 'active'
SELECT "dispersion_calculations".* FROM "dispersion_calculations" WHERE "dispersion_calculations"."dispersion_event_id" IN (2, 4, 5, 6)
SELECT "chemicals".* FROM "chemicals" WHERE "chemicals"."id" = 2
SELECT "locations".* FROM "locations" WHERE "locations"."id" = 1 LIMIT 1
---
  def dashboard
    # Main operational dashboard
    @active_events = DispersionEvent.where(status: 'active')
                                   .includes(:chemical, :location, :receptors, :dispersion_calculations)

    @recent_calculations = DispersionCalculation.includes(:dispersion_event, :weather_datum)
                                               .order(created_at: :desc)
                                               .limit(10)

    @current_weather = WeatherDatum.order(recorded_at: :desc).first

    # Statistics for dashboard widgets
    @stats = {
      total_events: DispersionEvent.count,
      active_events: @active_events.count,
      total_receptors: Receptor.count,
      calculations_today: DispersionCalculation.where('created_at >= ?', Date.current).count
    }

    # Prepare data for real-time updates
    @events_data = @active_events.map do |event|
      {
        id: event.id,
        name: "#{event.chemical.name} at #{event.location.name}",
        status: event.status,
        source_lat: event.location.latitude,
        source_lng: event.location.longitude,
        receptors: event.receptors.map do |receptor|