app/controllers/locations_controller.rb

  def index
    @locations = Location.all.order(:name)
---
SELECT "locations".* FROM "locations" ORDER BY "locations"."name" ASC