app/jobs/weather_update_job.rb

  def update_all_locations_weather
    Rails.logger.info "Starting weather update for all locations"

    locations_count = Location.count
    success_count = 0
    failure_count = 0

    Location.find_each do |location|
---
SELECT COUNT(*) FROM "locations"
SELECT "locations".* FROM "locations" ORDER BY "locations"."id" ASC LIMIT 1000

  def create_weather_record(weather_data, location)
    # Only create new record if significantly different from last reading
    last_reading = WeatherDatum.where(
      latitude: location.latitude,
      longitude: location.longitude
    ).order(:recorded_at).last

    if should_create_record?(weather_data, last_reading)
      weather_record = WeatherDatum.create!(
        recorded_at: weather_data[:timestamp] || Time.current,
        temperature: weather_data[:temperature],
        humidity: weather_data[:humidity],
        pressure: weather_data[:pressure],
        wind_speed: weather_data[:wind_speed],
        wind_direction: weather_data[:wind_direction],
        precipitation: weather_data[:precipitation] || 0,
        cloud_cover: weather_data[:cloud_cover] || 0,
        visibility: weather_data[:visibility] || 10,
        latitude: location.latitude,
        longitude: location.longitude,
        source: weather_data[:source] || 'api'
      )
---
INSERT INTO "weather_data" ("temperature", "humidity", "pressure", "wind_speed", "wind_direction", "precipitation", "cloud_cover", "visibility", "recorded_at", "latitude", "longitude", "source", "created_at", "updated_at") VALUES (28.0, 58.111261268611, 1015.9166, 5.66, 60.0, 0.0, 75.0, 16.09344, '2025-10-04 15:50:00', 29.7604, -95.3698, 'nws', '2025-10-04 16:13:52.101698', '2025-10-04 16:13:52.101698') RETURNING "id"